using UnityEngine;

public class SelectableObject : MonoBehaviour
{
    /*
    этот класс отвечает за объекты которые можно выделять в редакторе
    он может быть пустым, но он нужен для того чтобы SelectionManager мог определять какие объекты можно выделить а какие нет
    можно добавить сюда какие-то функции, если понадобится
    например, можно добавить функцию для выделения объекта и снятия выделения через шейдер, ну или типо того
    хотя не советую, лучше использовать SelectionManager для управления выделением
    но если понадобится, то можно добавить сюда
    */
}